[
    {
        "filename": "administrative-professional-short-form.html",
        "title": "Administrative Professional - Short Form | SHL",
        "content": "Administrative Professional - Short Form Description The Administrative Professional solution is for entry to mid-level positions that involve routine clerical and administrative functions in addition to office management functions and customer service. Sample tasks for this job include, but are not limited to: arranging conference calls; drafting correspondence; scheduling meetings; greeting visitors; coordinating office activities. Potential job titles that use this solution are: Administrative Assistant, Secretary, Office Manager, Administrative Aide, and Administrative Associate. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 36 Test Type: A K P Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "administrative-professional-short-form",
        "url": "https://www.shl.com/products/product-catalog/view/administrative-professional-short-form/",
        "duration": "N/A",
        "test_type": "A, K, P",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "automata-fix-new.html",
        "title": "Automata - Fix (New) | SHL",
        "content": "Automata - Fix (New) Description A simulated compiler integrated test to measure debugging skills in C, C++ and Java. The test checks the ability to fix logical or syntactical errors and to reuse an existing code. Your use of this assessment product may be subject to New York City Law 144 (Regulation of the Use of Automated Employment Decision Tools) (dated July 5, 2023). Compliance with Law 144 is your responsibility. Read more on https://www.shl.com/legal/shl-us-regulatory-compliance/ Job levels Mid-Professional, Languages English (USA), Assessment length Approximate Completion Time in minutes = max 20 Test Type: S Remote Testing: Downloads Product fact sheet English (USA) Sample Report English (USA)",
        "url_slug": "automata-fix-new",
        "url": "https://www.shl.com/products/product-catalog/view/automata-fix-new/",
        "duration": "N/A",
        "test_type": "S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "automata-selenium.html",
        "title": "Automata Selenium | SHL",
        "content": "Automata Selenium Description A coding simulation assessment that evaluates the ability to conduct tasks related to automation testing using Selenium scripts. Job levels Entry-Level, Graduate, Manager, Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 60 Test Type: S Remote Testing: Downloads Product fact sheet English (USA) Sample Report English (USA)",
        "url_slug": "automata-selenium",
        "url": "https://www.shl.com/products/product-catalog/view/automata-selenium/",
        "duration": "N/A",
        "test_type": "S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "automata-sql-new.html",
        "title": "Automata - SQL (New) | SHL",
        "content": "Automata - SQL (New) Description A simulated query writing test that measures the ability to write SQL queries to perform DDL, DML and DCL tasks. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = max 30 Test Type: S Remote Testing: Downloads Product fact sheet English (USA) Sample Report English (USA)",
        "url_slug": "automata-sql-new",
        "url": "https://www.shl.com/products/product-catalog/view/automata-sql-new/",
        "duration": "N/A",
        "test_type": "S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "bank-administrative-assistant-short-form.html",
        "title": "Bank Administrative Assistant - Short Form | SHL",
        "content": "Bank Administrative Assistant - Short Form Description The Administrative Assistant solution is for entry-level clerical positions that interact with external or internal customers. Sample tasks for these jobs include, but are not limited to: answering telephones, managing files and records, sorting mail, greeting customers, and collaborating with co-workers on projects. Potential job titles that use this solution are: Receptionist and Administrative Assistant. There are multiple configurations of this solution available. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 35 Test Type: A B K P Remote Testing: Downloads Product Fact Sheet English International",
        "url_slug": "bank-administrative-assistant-short-form",
        "url": "https://www.shl.com/products/product-catalog/view/bank-administrative-assistant-short-form/",
        "duration": "N/A",
        "test_type": "A, B, K, P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "basic-computer-literacy-windows-10-new.html",
        "title": "Basic Computer Literacy (Windows 10) (New) | SHL",
        "content": "Basic Computer Literacy (Windows 10) (New) Description The Basic Computer Literacy (Windows 10) simulation measures knowledge of general computer terminology, processes, and applications and the ability to perform certain operations in a simulated environment resembling the actual application. This simulation consists of both multiple choice and simulation-based questions, and includes the following topics: Application Software, Computer Terms, Internet and Email, Managing Files, Operating System, and Parts of the Computer. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 30 Test Type: S K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "basic-computer-literacy-windows-10-new",
        "url": "https://www.shl.com/products/product-catalog/view/basic-computer-literacy-windows-10-new/",
        "duration": "N/A",
        "test_type": "S, K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "business-communication-adaptive.html",
        "title": "Business Communication (adaptive) | SHL",
        "content": "Business Communication (adaptive) Description This is an adaptive test that measures knowledge of communicating in the workplace. It measures the skills necessary to communicate effectively with coworkers at all levels and with external business contacts. Designed for the average business worker, this test includes the following topics: Electronic Communication, Employment Communication, Listening, Meetings, Nonverbal Communication, Verbal Communication, and Written Communication. Job levels Entry-Level, Front Line Manager, Manager, Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 24 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "business-communication-adaptive",
        "url": "https://www.shl.com/products/product-catalog/view/business-communication-adaptive/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "core-java-advanced-level-new.html",
        "title": "Core Java (Advanced Level) (New) | SHL",
        "content": "Core Java (Advanced Level) (New) Description Multi-choice test that measures the knowledge of basic Java constructs, OOP concepts, files and exception handling, and advanced Java concepts like generics, collections, threads, strings and concurrency. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 13 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "core-java-advanced-level-new",
        "url": "https://www.shl.com/products/product-catalog/view/core-java-advanced-level-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "core-java-entry-level-new.html",
        "title": "Core Java (Entry Level) (New) | SHL",
        "content": "Core Java (Entry Level) (New) Description Multi-choice test that measures the knowledge of basic Java constructs, OOP concepts, file handling, exception handling, threads, generic class and inner class. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 13 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "core-java-entry-level-new",
        "url": "https://www.shl.com/products/product-catalog/view/core-java-entry-level-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "css3-new.html",
        "title": "CSS3 (New) | SHL",
        "content": "CSS3 (New) Description Multi-choice test that measures the knowledge of CSS3 and its application in providing style to web documents. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 8 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "css3-new",
        "url": "https://www.shl.com/products/product-catalog/view/css3-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "data-warehousing-concepts.html",
        "title": "Data Warehousing Concepts | SHL",
        "content": "Data Warehousing Concepts Description The Data Warehousing Concepts test measures knowledge of Data Warehousing. Designed for experienced users, this test covers the following topics: Big Data and Data Warehouse Appliance, Business Considerations, Data Transformation, Data Warehousing and Data Marts, Design, Dimensional Data Model, On Line Analytical Processing (OLAP), Querying and Reporting/Data Extraction. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 25 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "data-warehousing-concepts",
        "url": "https://www.shl.com/products/product-catalog/view/data-warehousing-concepts/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "digital-advertising-new.html",
        "title": "Digital Advertising (New) | SHL",
        "content": "Digital Advertising (New) Description Multi-choice test that measures the candidate's knowledge about use of AdWords and tools to analyze ad performance on digital media. Job levels Graduate, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 7 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "digital-advertising-new",
        "url": "https://www.shl.com/products/product-catalog/view/digital-advertising-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "drupal-new.html",
        "title": "Drupal (New) | SHL",
        "content": "Drupal (New) Description Multi-choice test that measures the knowledge of Drupal setup, content management, user interface, module development and security. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 17 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "drupal-new",
        "url": "https://www.shl.com/products/product-catalog/view/drupal-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "english-comprehension-new.html",
        "title": "English Comprehension (New) | SHL",
        "content": "English Comprehension (New) Description Multiple-choice test that measures vocabulary, grammar and reading comprehension skills. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 0 Test Type: K Remote Testing: Downloads Product Flyer English (USA) Product Fact Sheet English (USA)",
        "url_slug": "english-comprehension-new",
        "url": "https://www.shl.com/products/product-catalog/view/english-comprehension-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "enterprise-leadership-report-2-0.html",
        "title": "Enterprise Leadership Report 2.0 | SHL",
        "content": "Enterprise Leadership Report 2.0 Description Assess and benchmark your leaders against enterprise leadership - the model for leader impact to drive business results in a complex work environment. For more information, visit: https://www.shl.com/en/solutions/identify-develop-leaders/enterprise-leadership/ . Job levels Director, Executive, Manager, Mid-Professional, Test Type: P Remote Testing: Downloads Sample Report English International Sample Report Latin American Spanish Sample Report English (USA) Sample Report French Sample Report German Sample Report Italian",
        "url_slug": "enterprise-leadership-report-2-0",
        "url": "https://www.shl.com/products/product-catalog/view/enterprise-leadership-report-2-0/",
        "duration": "N/A",
        "test_type": "P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "enterprise-leadership-report.html",
        "title": "Enterprise Leadership Report 1.0 | SHL",
        "content": "Enterprise Leadership Report 1.0 Description Assess and benchmark your leaders against enterprise leadership - the model for leader impact to drive business results in a complex work environment. For more information, visit: https://www.shl.com/en/solutions/identify-develop-leaders/enterprise-leadership/ . Job levels Director, Executive, Manager, Mid-Professional, Test Type: P Remote Testing: Downloads Sample Report English International Sample Report English (USA) Sample Report Arabic Sample Report Chinese Simplified Sample Report Dutch Sample Report French Sample Report German Sample Report Italian Sample Report Portuguese (Brazil)",
        "url_slug": "enterprise-leadership-report",
        "url": "https://www.shl.com/products/product-catalog/view/enterprise-leadership-report/",
        "duration": "N/A",
        "test_type": "P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "entry-level-sales-7-1.html",
        "title": "Entry level Sales 7.1 (International) | SHL",
        "content": "Entry level Sales 7.1 (International) Description The Entry Level Sales 7.1 Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer. Report Language Availability: English (USA), English International, Portuguese, French Canadian, German, French, Chinese Simplified, Spanish, North American Spanish. Job levels Entry-Level, Languages English (USA), Spanish, Latin American Spanish, French, German, French (Canada), English International, Chinese Simplified, Portuguese, Assessment length Approximate Completion Time in minutes = 20 Test Type: P B C Remote Testing: Downloads Candidate Report English International Detailed Report English International Interview Report English International Candidate Report French (Canada) Detailed Report French (Canada) Interview Report French (Canada) Candidate Report Latin American Spanish Detailed Report Latin American Spanish Interview Report Latin American Spanish Candidate Report English (USA) Detailed Report English (USA) Interview Report English (USA) Candidate Report Chinese Simplified Detailed Report Chinese Simplified Interview Report Chinese Simplified Candidate Report French Detailed Report French Interview Report French Candidate Report German Detailed Report German Interview Report German Candidate Report Portuguese Detailed Report Portuguese Interview Report Portuguese Candidate Report Spanish Detailed Report Spanish Interview Report Spanish",
        "url_slug": "entry-level-sales-7-1"
    },
    {
        "filename": "entry-level-sales-sift-out-7-1.html",
        "title": "Entry Level Sales Sift Out 7.1 | SHL",
        "content": "Entry Level Sales Sift Out 7.1 Description The Entry Level Sales Sift Out 7.1 Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer Job levels Entry-Level, Languages Swedish, Chinese Simplified, Finnish, English (USA), Portuguese (Brazil), French, Danish, Italian, Arabic, Dutch, French (Canada), Latin American Spanish, English International, Norwegian, German, Assessment length Approximate Completion Time in minutes = 20 Test Type: C P B Remote Testing:",
        "url_slug": "entry-level-sales-sift-out-7-1"
    },
    {
        "filename": "entry-level-sales-solution.html",
        "title": "Entry Level Sales Solution | SHL",
        "content": "Entry Level Sales Solution Description The Precise Fit Entry Level Sales Roles Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer. Report Language Availability: English (USA) Job levels Entry-Level, Languages German, Italian, Chinese Simplified, Finnish, Danish, English (USA), English International, Latin American Spanish, French (Canada), French, Dutch, Norwegian, Swedish, Arabic, Assessment length Approximate Completion Time in minutes = 20 Test Type: C P Remote Testing: Downloads Candidate Report Latin American Spanish Detailed Report Latin American Spanish Interview Report Latin American Spanish Product fact sheet English (USA) Detailed Report English (USA) Development Report English (USA) Interview Report English (USA) Product fact sheet Chinese Simplified",
        "url_slug": "entry-level-sales-solution",
        "url": "https://www.shl.com/products/product-catalog/view/entry-level-sales-solution/",
        "duration": "N/A",
        "test_type": "C, P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "financial-professional-short-form.html",
        "title": "Financial Professional - Short Form | SHL",
        "content": "Financial Professional - Short Form Description This solution is for mid-level financial institution positions that require Series 6/7 certification. Candidates answer multiple choice questions to measure financial professional aptitude, learning potential, achievement orientation, conscientiousness, persistence and planfulness, self leadership, interpersonal leadership, sales focus and customer focus. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 35 Test Type: A B P Remote Testing: Downloads Fact Sheet Financial Professional One Sitting_USE English (USA)",
        "url_slug": "financial-professional-short-form"
    },
    {
        "filename": "general-entry-level-data-entry-7-0-solution.html",
        "title": "General Entry Level – Data Entry 7.0 Solution | SHL",
        "content": "General Entry Level – Data Entry 7.0 Solution Description Our General Entry Level – Data Entry 7.0 solution is designed for entry-level positions that include entering data into computers or data management systems. This solution measures speed and accuracy at typing text and numbers into forms and predicts the following types of behaviors foundational to all jobs: being on-time to work; following rules and policies; treating others respectfully; producing quality work; meeting goals; and approaching work in a thorough and precise manner. This solution can be used across all industries with entry-level positions. Example titles include, but are not limited to: Accounting Clerk, Accounts Receivable Clerk, Administrative Clerk, Clerical Aide, Clerical Assistant, Office Assistant, Office Services Specialist, Staff Assistant. Report Language Availability: English (USA) Job levels General Population, Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 24 Test Type: B K Remote Testing: Downloads Detailed Report English (USA) Product fact sheet English (USA) Development Report English (USA) Interview Report English (USA)",
        "url_slug": "general-entry-level-data-entry-7-0-solution"
    },
    {
        "filename": "global-skills-assessment.html",
        "title": "Global Skills Assessment | SHL",
        "content": "Global Skills Assessment Description The Global Skills Assessment (GSA) is an assessment used to measure 96 discrete skills/behaviors. These 96 skill scores are directly aligned to the most discrete level of SHL’s Universal Competency Framework (UCF). The GSA measures self-reported behaviors an individual currently engages in. A person’s skills (sets of behavior) are malleable and may change over time. SHL utilizes GSA scores to understand what the participant reports they can do today. Languages Indonesian, Italian, Swedish, Thai, Portuguese (Brazil), French (Canada), Chinese Simplified, Danish, Finnish, French, German, English International, Japanese, Korean, Latin American Spanish, Norwegian, Polish, Romanian, Spanish, Vietnamese, Chinese Traditional, Arabic, English (USA), Dutch, Portuguese, Turkish, Assessment length Approximate Completion Time in minutes = 16 Test Type: C K Remote Testing: Downloads Fact Sheet English (USA)",
        "url_slug": "global-skills-assessment",
        "url": "https://www.shl.com/products/product-catalog/view/global-skills-assessment/",
        "duration": "N/A",
        "test_type": "C, K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "htmlcss-new.html",
        "title": "HTML/CSS (New) | SHL",
        "content": "HTML/CSS (New) Description Multi-choice test that measures the knowledge of HTML to create a user interface and CSS to stylize it. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 12 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "htmlcss-new",
        "url": "https://www.shl.com/products/product-catalog/view/htmlcss-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "interpersonal-communications.html",
        "title": "Interpersonal Communications | SHL",
        "content": "Interpersonal Communications Description This adaptive test measures the candidate's knowledge of how to employ effective verbal and non-verbal communication to send his or her message and manage conflicts. It is designed for all professionals and covers the following topics: Communication and Perception, Group Communication and Teamwork, Intercultural Communication, Interpersonal Communication, Interviewing and Communication, Intrapersonal Communication, Listening, Nonverbal Communication, Technology in Communication, Verbal Communication, and Language. Job levels Entry-Level, Front Line Manager, Manager, Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 15 to 35 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "interpersonal-communications",
        "url": "https://www.shl.com/products/product-catalog/view/interpersonal-communications/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "java-8-new.html",
        "title": "Java 8 (New) | SHL",
        "content": "Java 8 (New) Description Multi-choice test that measures the knowledge of Java class design, exceptions, generics, collections, concurrency, JDBC and Java I/O fundamentals. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 18 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "java-8-new",
        "url": "https://www.shl.com/products/product-catalog/view/java-8-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "javascript-new.html",
        "title": "JavaScript (New) | SHL",
        "content": "JavaScript (New) Description Multi-choice test that measures knowledge of programming in the JavaScript language and its application in front-end development. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 9 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "javascript-new",
        "url": "https://www.shl.com/products/product-catalog/view/javascript-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "manager-8-0-jfa-4310.html",
        "title": "Manager 8.0+ JFA | SHL",
        "content": "Manager 8.0+ JFA Description The Manager 8.0+ Job-Focused Assessment is designed for candidates applying to their first leadership positions and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Inductive Reasoning. It measures behaviors that underlie successful performance in first-line manager roles across a wide range of industries. It is most relevant to positions that supervise salaried employees. This JFA includes the Reskilling Potential Scale and the Management Potential Scale. •The Reskilling Potential scale measures tendency to learn from experiences in a way that supports professional success. •The Management Potential scale measures the potential for managerial success across industry type and functional area. Job levels Manager, Languages English (USA), English International, Assessment length Approximate Completion Time in minutes = 44 Test Type: B K P Remote Testing: Downloads Fact Sheet English International Candidate Report English International Detailed Report English International Interview Report English International Fact Sheet English International Candidate Report English (USA) Detailed Report English (USA) Interview Report English (USA)",
        "url_slug": "manager-8-0-jfa-4310"
    },
    {
        "filename": "manual-testing-new.html",
        "title": "Manual Testing (New) | SHL",
        "content": "Manual Testing (New) Description Multi-choice test that measures the knowledge of the software testing life cycle, testing tools and techniques, design of test cases and generation of test reports. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 10 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "manual-testing-new",
        "url": "https://www.shl.com/products/product-catalog/view/manual-testing-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "marketing-new.html",
        "title": "Marketing (New) | SHL",
        "content": "Marketing (New) Description Multi-choice test that measures the conceptual knowledge of marketing principles, market research, consumer behavior, brand management, sales management, channel management and advertisement management. Job levels Graduate, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 9 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "marketing-new",
        "url": "https://www.shl.com/products/product-catalog/view/marketing-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "microsoft-excel-365-essentials-new.html",
        "title": "Microsoft Excel 365 - Essentials (New) | SHL",
        "content": "Microsoft Excel 365 - Essentials (New) Description The Microsoft Excel 365 - Essentials simulation evaluates ability to perform certain operations in a simulated environment of MS Excel, and includes the following topics: Applying Formulas and Functions, Creating and Analyzing Data, Formatting Cells, Data, and Content, Managing Workbooks and Worksheets, Presenting Data Visually, Printing and Views, and Sharing, Maintaining, and Securing Workbooks. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 30 Test Type: K S Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "microsoft-excel-365-essentials-new",
        "url": "https://www.shl.com/products/product-catalog/view/microsoft-excel-365-essentials-new/",
        "duration": "N/A",
        "test_type": "K, S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "microsoft-excel-365-new.html",
        "title": "Microsoft Excel 365 (New) | SHL",
        "content": "Microsoft Excel 365 (New) Description The Microsoft Excel 365 simulation evaluates ability to perform certain operations in a simulated environment of MS Excel, and includes the following topics: Applying Formulas and Functions, Creating and Analyzing Data, Formatting Cells, Data, and Content, Managing Workbooks and Worksheets, Presenting Data Visually, Printing and Views, and Sharing, Maintaining, and Securing Workbooks. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 35 Test Type: K S Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "microsoft-excel-365-new",
        "url": "https://www.shl.com/products/product-catalog/view/microsoft-excel-365-new/",
        "duration": "N/A",
        "test_type": "K, S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "occupational-personality-questionnaire-opq32r.html",
        "title": "Occupational Personality Questionnaire OPQ32r | SHL",
        "content": "Occupational Personality Questionnaire OPQ32r Description The SHL Occupational Personality Questionnaire, the OPQ32, is one of the most widely used and respected measures of workplace behavioural style in the world. It sets a high standard of measurement excellence, providing HR professionals and business managers with relevant and accurate information to make fast and well-informed people decisions. The OPQ32 provides a clear framework for understanding the impact of personality on job performance. It is internationally recognised for its accuracy of assessment. Over 90 independent validation studies have been conducted on the OPQ over a period of 25 years, across 20 countries and 40 industries, providing concrete evidence of its power to predict performance in the workplace. Job levels Professional Individual Contributor, Supervisor, Mid-Professional, Front Line Manager, General Population, Graduate, Manager, Director, Executive, Languages English International, French (Canada), Portuguese, Chinese Simplified, Chinese Traditional, French (Belgium), French, Polish, Slovak, Czech, Danish, Flemish, Dutch, Estonian, Finnish, German, Greek, Hungarian, Icelandic, Indonesian, Italian, Japanese, Korean, Latvian, Lithuanian, Norwegian, English (USA), Arabic, Portuguese (Brazil), Spanish, Latin American Spanish, Romanian, Russian, Serbian, Swedish, Thai, Turkish, Malay, Vietnamese, Assessment length Approximate Completion Time in minutes = Untimed, approx. 25 Test Type: P Remote Testing: Downloads Product Fact Sheet English International Product Fact Sheet French",
        "url_slug": "occupational-personality-questionnaire-opq32r",
        "url": "https://www.shl.com/products/product-catalog/view/occupational-personality-questionnaire-opq32r/",
        "duration": "N/A",
        "test_type": "P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "opq-leadership-report.html",
        "title": "OPQ Leadership Report | SHL",
        "content": "OPQ Leadership Report Description This OPQ (Occupational Personality Questionnaire) report provides a detailed analysis of an individual's leadership potential. It is based on SHL's leading edge Leadership Model, providing a competency based approach to leadership. Job levels Director, Executive, Manager, Mid-Professional, Professional Individual Contributor, Languages Dutch, English International, English (USA), Romanian, Portuguese, French, German, Swedish, Chinese Simplified, Portuguese (Brazil), Japanese, Polish, Russian, Latin American Spanish, Test Type: P Remote Testing: Downloads Report Fact Sheet English International Sample Report English International Sample Report Latin American Spanish Sample Report English (USA) Sample Report Chinese Simplified Sample Report Japanese Sample Report Korean Sample Report Danish Sample Report Dutch Sample Report French Sample Report German Sample Report Polish Sample Report Portuguese Sample Report Romanian Sample Report Russian Sample Report Swedish Sample Report Portuguese (Brazil)",
        "url_slug": "opq-leadership-report",
        "url": "https://www.shl.com/products/product-catalog/view/opq-leadership-report/",
        "duration": "N/A",
        "test_type": "P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "opq-team-types-and-leadership-styles-report.html",
        "title": "OPQ Team Types and Leadership Styles Report | SHL",
        "content": "OPQ Team Types and Leadership Styles Report Description This OPQ (Occupational Personality Questionnaire) report is based on Belbin's team types and Bass's leadership and reporting styles. Belbins team types: individual preferred role when working in ateam. Bass's leadership and reporting styles: individuals preferred leadership styles and likely style of behaviour as a direct report. Job levels Director, Executive, Front Line Manager, General Population, Graduate, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Languages Flemish, French (Belgium), Portuguese (Brazil), Danish, Dutch, Finnish, French (Canada), French, Italian, Latin American Spanish, Norwegian, Portuguese, English International, English (USA), Test Type: P Remote Testing: Downloads Sample Report English International Sample Report French (Canada) Sample Report Latin American Spanish Sample Report English (USA) Sample Report Danish Sample Report Dutch Sample Report Finnish Sample Report French Sample Report Italian Sample Report Norwegian Sample Report Portuguese Sample Report Portuguese (Brazil)",
        "url_slug": "opq-team-types-and-leadership-styles-report",
        "url": "https://www.shl.com/products/product-catalog/view/opq-team-types-and-leadership-styles-report/",
        "duration": "N/A",
        "test_type": "P",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "professional-7-0-solution-3958.html",
        "title": "Professional + 7.0 Solution | SHL",
        "content": "Professional + 7.0 Solution Description Our Professional + 7.0 solution is designed for all non-managerial professional individual contributor positions, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services. Report Language Availability: English (USA). Job levels Mid-Professional, Professional Individual Contributor, Languages English International, English (USA), Assessment length Approximate Completion Time in minutes = 51 Test Type: A B C Remote Testing: Downloads Professional + 7.0 Detailed Report English (USA) Professional + 7.0 Development Report English (USA) Professional + 7.0 Interview Report English (USA) Product Fact Sheet English (USA)",
        "url_slug": "professional-7-0-solution-3958"
    },
    {
        "filename": "professional-7-1-solution.html",
        "title": "Professional + 7.1 (International) | SHL",
        "content": "Professional + 7.1 (International) Description Our Professional + 7.1 solution is designed for all non-managerial professional individual contributor positions, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services. Job levels General Population, Mid-Professional, Professional Individual Contributor, Languages Chinese Traditional, Dutch, Chinese Simplified, French, English International, Swedish, Italian, Norwegian, Danish, English (USA), French (Canada), Portuguese (Brazil), Spanish, German, Portuguese, Finnish, Assessment length Approximate Completion Time in minutes = 56 Test Type: B C P Remote Testing: Downloads Candidate Report English International Detailed Report English International Interview Report English International Candidate Report French (Canada) Detailed Report French (Canada) Interview Report French (Canada) Candidate Report English (USA) Detailed Report English (USA) Interview Report English (USA) Candidate Report Chinese Traditional Detailed Report Chinese Traditional Interview Report Chinese Traditional Candidate Report Chinese Simplified Detailed Report Chinese Simplified Interview Report Chinese Simplified Candidate Report Danish Detailed Report Danish Interview Report Danish Candidate Report Dutch Detailed Report Dutch Interview Report Dutch Candidate Report Finnish Detailed Report Finnish Interview Report Finnish Candidate Report French Detailed Report French Interview Report French Candidate Report German Detailed Report German Interview Report German Candidate Report Italian Detailed Report Italian Interview Report Italian Candidate Report Norwegian Detailed Report Norwegian Interview Report Norwegian Candidate Report Portuguese Detailed Report Portuguese Interview Report Portuguese Candidate Report Spanish Detailed Report Spanish Interview Report Spanish Candidate Report Swedish Detailed Report Swedish Interview Report Swedish Candidate Report Portuguese (Brazil) Detailed Report Portuguese (Brazil) Interview Report Portuguese (Brazil)",
        "url_slug": "professional-7-1-solution"
    },
    {
        "filename": "python-new.html",
        "title": "Python (New) | SHL",
        "content": "Python (New) Description Multi-choice test that measures the knowledge of Python programming, databases, modules and library. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 11 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "python-new",
        "url": "https://www.shl.com/products/product-catalog/view/python-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "sales-representative-solution.html",
        "title": "Sales Representative Solution | SHL",
        "content": "Sales Representative Solution Description The Sales Representative solution is for entry-level sales positions in which employees proactively sell products to customers and have their pay and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer. Potential job titles that use this solution are: Sales Representative, Sales Associate, and Sales Clerk. Multiple configurations of this solution are available. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 29 Test Type: A B P Remote Testing: Downloads Fact Sheet Sales Representative One Sitting_USE English (USA)",
        "url_slug": "sales-representative-solution"
    },
    {
        "filename": "search-engine-optimization-new.html",
        "title": "Search Engine Optimization (New) | SHL",
        "content": "Search Engine Optimization (New) Description Multi-choice test that measures the knowledge on the concepts of need of SEO, SEO planning, SEO strategies, SEO software, tools and exchanging links. Job levels Graduate, Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 12 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "search-engine-optimization-new",
        "url": "https://www.shl.com/products/product-catalog/view/search-engine-optimization-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "selenium-new.html",
        "title": "Selenium (New) | SHL",
        "content": "Selenium (New) Description Multi-choice test that measures the knowledge of Selenium IDE, Selenium RC, Selenium grid, web driver, test design considerations, user extensions, frameworks and object repository. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 10 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "selenium-new",
        "url": "https://www.shl.com/products/product-catalog/view/selenium-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "shl-verify-interactive-inductive-reasoning.html",
        "title": "SHL Verify Interactive - Inductive Reasoning | SHL",
        "content": "SHL Verify Interactive - Inductive Reasoning Description Evaluates ability to identify specific patterns in data or situations and generalize that information to broader contexts. Job levels Professional Individual Contributor, Graduate, Manager, Mid-Professional, Languages Korean, Japanese, Thai, Portuguese (Brazil), Portuguese, Chinese Traditional, Indonesian, Russian, Romanian, Polish, Greek, Latin American Spanish, English International, Arabic, Hungarian, Czech, French (Canada), Slovak, Serbian, Turkish, Spanish, Danish, Estonian, Finnish, Latvian, Lithuanian, Norwegian, Swedish, French, German, Italian, Dutch, Chinese Simplified, English (USA), Assessment length Approximate Completion Time in minutes = 20 Test Type: A S Remote Testing: Downloads Product Fact Sheet English (USA) Product Fact Sheet Danish Product Fact Sheet Dutch Product Fact Sheet French Product Fact Sheet German Product Fact Sheet Italian Product Fact Sheet Swedish",
        "url_slug": "shl-verify-interactive-inductive-reasoning",
        "url": "https://www.shl.com/products/product-catalog/view/shl-verify-interactive-inductive-reasoning/",
        "duration": "N/A",
        "test_type": "A, S",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "shl-verify-interactive-numerical-calculation.html",
        "title": "SHL Verify Interactive Numerical Calculation | SHL",
        "content": "SHL Verify Interactive Numerical Calculation Description The Verify Interactive Numerical Calculation test measures a candidate’s ability to work with numbers and use appropriate mathematics in different situations. The Numerical Ability test requires candidates to understand order of operations, perform numerical calculations, and identify errors in calculations. The Numerical Calculation test, though it is adaptive, is ideal for entry-level jobs that require completing simple numerical calculations quickly and accurately. Job levels Entry-Level, Languages English (USA), English International, Assessment length Approximate Completion Time in minutes = 10 Test Type: A Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "shl-verify-interactive-numerical-calculation",
        "url": "https://www.shl.com/products/product-catalog/view/shl-verify-interactive-numerical-calculation/",
        "duration": "N/A",
        "test_type": "A",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "sql-server-analysis-services-28ssas29-28new29.html",
        "title": "SQL Server Analysis Services (SSAS) (New) | SHL",
        "content": "SQL Server Analysis Services (SSAS) (New) Description Multi-choice test that measures the knowledge of SSAS database, querying multidimensional analysis solutions, cube hierarchies, measures, dimensions, power BI, DAX, MDX, tabular model data access and security. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 15 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "sql-server-analysis-services-28ssas29-28new29"
    },
    {
        "filename": "sql-server-new.html",
        "title": "SQL Server (New) | SHL",
        "content": "SQL Server (New) Description Multi-choice test that measures the knowledge of basic SQL queries, creating and altering tables, filtering, grouping, aggregation in SQL and querying multiple tables. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 11 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "sql-server-new",
        "url": "https://www.shl.com/products/product-catalog/view/sql-server-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "svar-spoken-english-indian-accent-new.html",
        "title": "SVAR - Spoken English (Indian Accent)  (New) | SHL",
        "content": "SVAR - Spoken English (Indian Accent) (New) Description An automated spoken English test that measures fluency, pronunciation, active listening, vocabulary, grammar and spoken English understanding. Your use of this assessment product may be subject to New York City Law 144 (Regulation of the Use of Automated Employment Decision Tools) (dated July 5, 2023). Compliance with Law 144 is your responsibility. Read more on https://www.shl.com/legal/shl-us-regulatory-compliance/ Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = - Test Type: S Remote Testing: Downloads Product Flyer English (USA)",
        "url_slug": "svar-spoken-english-indian-accent-new",
        "url": "https://www.shl.com/products/product-catalog/view/svar-spoken-english-indian-accent-new/",
        "duration": "N/A",
        "test_type": "S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "tableau-new.html",
        "title": "Tableau (New) | SHL",
        "content": "Tableau (New) Description Multi-choice test that measures the knowledge of how to use Tableau to prepare tables, create visualizations, perform calculations, apply filters and carry out forecasting. Job levels Mid-Professional, Professional Individual Contributor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 8 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "tableau-new",
        "url": "https://www.shl.com/products/product-catalog/view/tableau-new/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "technical-sales-associate-solution.html",
        "title": "Technical Sales Associate Solution | SHL",
        "content": "Technical Sales Associate Solution Description The Technical Sales Associate solution is for entry-level retail positions in which employees proactively sell a specific line of products that requires substantial knowledge about the products and have their pay and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: obtaining detailed product information, promoting products to customers, persuading customers to buy products, and completing a transaction with a customer. Potential job titles that use this solution are: Sales Representative, Retail Sales Associate, and Sales Clerk. Multiple configurations of this solution are available. Job levels Entry-Level, Languages English (USA), Assessment length Approximate Completion Time in minutes = 41 Test Type: A B P Remote Testing: Downloads Fact Sheet Technical Sales Associate One Sitting_USE English (USA)",
        "url_slug": "technical-sales-associate-solution"
    },
    {
        "filename": "verify-numerical-ability.html",
        "title": "Verify - Numerical Ability | SHL",
        "content": "Verify - Numerical Ability Description The next-generation Verify Numerical Ability Test provides a replacement for the existing Numerical Reasoning test in our Verify range of ability tests and the Global Cognitive Index – Adaptive Quantitative test, and measures the ability to: • Derive the numerical problem from a written problem • Calculate the answer to numerical equations • Work with numerical data in a realistic workplace context The test is 20 minutes long, has 16 items and is designed to provide an indication of how an individual will perform when asked to work with numerical information or statistical details. Job levels Director, Entry-Level, Executive, Front Line Manager, General Population, Graduate, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Languages Arabic, Portuguese (Brazil), French (Canada), Chinese Simplified, Czech, Dutch, Finnish, French, German, Hungarian, Indonesian, English International, Italian, Japanese, Korean, Norwegian, Portuguese, Romanian, Russian, Slovak, Spanish, Swedish, Turkish, English (USA), Latin American Spanish, Polish, Serbian, Chinese Traditional, Danish, Thai, Greek, Assessment length Approximate Completion Time in minutes = 20 Test Type: A Remote Testing: Downloads Product Fact Sheet English International",
        "url_slug": "verify-numerical-ability",
        "url": "https://www.shl.com/products/product-catalog/view/verify-numerical-ability/",
        "duration": "N/A",
        "test_type": "A",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "verify-verbal-ability-next-generation.html",
        "title": "Verify - Verbal Ability - Next Generation | SHL",
        "content": "Verify - Verbal Ability - Next Generation Description The Verbal Ability test measures the ability to read written passages and comprehend the text, interpret tone and author intent, identify main ideas, and predict author responses. Sample tasks for jobs that may require verbal ability include, but are not limited to: working with reports, correspondence, instructions, and research information. The Verbal Ability test, due to its adaptive nature, is appropriate for all job levels and roles. Job levels General Population, Graduate, Executive, Director, Entry-Level, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Front Line Manager, Languages English (USA), English International, Assessment length Approximate Completion Time in minutes = 15 minutes Test Type: A Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "verify-verbal-ability-next-generation",
        "url": "https://www.shl.com/products/product-catalog/view/verify-verbal-ability-next-generation/",
        "duration": "N/A",
        "test_type": "A",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    },
    {
        "filename": "writex-email-writing-sales-new.html",
        "title": "WriteX - Email Writing (Sales) (New) | SHL",
        "content": "WriteX - Email Writing (Sales) (New) Description Open response test that evaluates the ability to write proper emails in English. The test provides scores on content, grammar and email etiquette. Your use of this assessment product may be subject to New York City Law 144 (Regulation of the Use of Automated Employment Decision Tools) (dated July 5, 2023). Compliance with Law 144 is your responsibility. Read more on https://www.shl.com/legal/shl-us-regulatory-compliance/ Job levels Entry-Level, Graduate, Manager, Mid-Professional, Professional Individual Contributor, Supervisor, Languages English (USA), Assessment length Approximate Completion Time in minutes = 15 Test Type: B S Remote Testing: Downloads Product Flyer English (USA) Product fact sheet English (USA) Sample Report English (USA)",
        "url_slug": "writex-email-writing-sales-new",
        "url": "https://www.shl.com/products/product-catalog/view/writex-email-writing-sales-new/",
        "duration": "N/A",
        "test_type": "B, S",
        "remote_testing": "Yes",
        "adaptive_irt": "No"
    },
    {
        "filename": "written-english-v1.html",
        "title": "Written English v1 | SHL",
        "content": "Written English v1 Description The Written English test measures knowledge of US English grammar and English reading comprehension. It is designed for those with English as a second language and covers the following topics: Articles, Comparisons, Conjunctions, General Questions, Misused Words, Nouns, Parallel Structure, Prepositions, Pronouns, Specific Questions, and Verbs. Job levels Entry-Level, Front Line Manager, Mid-Professional, Professional Individual Contributor, Languages English (USA), English International, Assessment length Approximate Completion Time in minutes = 30 Test Type: K Remote Testing: Downloads Product Fact Sheet English (USA)",
        "url_slug": "written-english-v1",
        "url": "https://www.shl.com/products/product-catalog/view/written-english-v1/",
        "duration": "N/A",
        "test_type": "K",
        "remote_testing": "Yes",
        "adaptive_irt": "Yes"
    }
]